Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/unemployment_and_redundancy/redundancy/frequently_asked_questions_about_redundancy.html.txt.tmx
Source language: en
Languages: ga

source: If I am made redundant and I then get an offer of work from my previous employer, will this affect my redundancy payment?
ga: Má dhéantar mé iomarcach agus má fhaighim tairiscint oibre ó mo iarfhostóir, cén dóigh a dtéann sé i bhfeidhm ar m’íocaíocht iomarcaíochta?

source: If your employer offers you alternative work, you may lose your entitlement to a redundancy payment in the following circumstances:
ga: Má dhéanann d'fhostóir tairiscint ar obair mhalartach duit, d’fhéadfadh do theidlíocht íocaíocht iomarcaíochta a chailleadh sna cúinsí seo a leanas:

source: • If you accept a new contract or re-engagement with immediate effect and the terms do not differ from those of the previous contract
ga: • Má ghlacann tú le conradh nua nó athfhostú le héifeacht láithreach agus nach bhfuil na téarmaí difriúil uathu sin sa chonradh roimhe

source: • If your employer makes you a reasonable offer of alternative work, and you refuse it
ga: • Má dhéanann d'fhostóir tairiscint réasúnta ar obair mhalartach duit, agus má dhiúltaíonn tú í

source: • If you accept an offer in writing from your employer for a new and different contract which will take effect within 4 weeks of the ending of the previous contract
ga: • Má ghlacann tú leis an tairiscint i scríbhinn ó d'fhostóir ar chonradh nua agus difriúil a bheidh éifeachtach laistigh de 4 seachtaine ó dheireadh an chonartha roimhe

source: Equally, if you refuse such an offer unreasonably, you may lose your right to a redundancy payment
ga: Ar an mbealach céanna, má dhiúltaíonn tú tairiscint mar seo go míréasúnta, caillfidh tú do cheart ar íocaíocht iomarcaíochta

source: You can read more information about alternative work in our document on redundancy procedures
ga: Tá tuilleadh eolais maidir le hobair mhalartach inár ndoiciméad faoi nósanna imeachta iomarcaíochta
